coupling/interfoam_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   100;

// Sphere

// vertices
// (
//     (675 425 0)
//     (675 575 0)
//     (825 575 0)
//     (825 425 0)
//     (675 425 20)
//     (675 575 20)
//     (825 575 20)
//     (825 425 20)
// );

// Plane

vertices
(
    (600 350 0)
    (600 650 0)
    (900 650 0)
    (900 350 0)
    (600 350 20)
    (600 650 20)
    (900 650 20)
    (900 350 20)
);



blocks
(
    hex (0 3 2 1 4 7 6 5) (150 150 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (7 6 5 4)
        );
    }
    interaction
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (3 7 4 0)
        );
    }
);


// ************************************************************************* //
