coupling/interfoam_case/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh     true;
snap                true;
addLayers           false;
mergeTolerance      1e-06;
debug               0;

geometry
{
    geometry.stl // STL filename
    {
        type triSurfaceMesh;
        regions
        {
            solid             // Named region in the STL file
            {
                name obstacle;         // User-defined patch name
            }                       // otherwise given sphere.stl_secondSolid
       }
    }
}

castellatedMeshControls
{
    locationInMesh                  (60250 35250 250);
    maxLocalCells                   1e+06;
    maxGlobalCells                  2e+06;
    minRefinementCells              0;
    maxLoadUnbalance                0.1;
    nCellsBetweenLevels             1;
    resolveFeatureAngle             30;
    allowFreeStandingZoneFaces      false;

    features
    (
        {
            file "geometry.eMesh";
            level 2;
        }
    );

    refinementSurfaces
    {
        geometry.stl
        {
            level (2 2);
        }
    }

    refinementRegions
    {
        geometry.stl
        {
            mode distance;
            levels ((100 2));
        }
    }
}

snapControls
{
    nSmoothPatch                    3;
    tolerance                       4.0;
    nSolveIter                      30;
    nRelaxIter                      5;
    nFeatureSnapIter                10;
    implicitFeatureSnap             false;
    explicitFeatureSnap             true;
    multiRegionFeatureSnap          false;
}

addLayersControls
{

}

meshQualityControls
{
    maxNonOrtho                     65;
    maxBoundarySkewness             20;
    maxInternalSkewness             4;
    maxConcave                      80;
    minFlatness                     0.5;
    minVol                          1e-13;
    minTetQuality                   1e-13;
    minArea                         -1;
    minTwist                        0.05;
    minDeterminant                  0.001;
    minFaceWeight                   0.05;
    minVolRatio                     0.01;
    minTriangleTwist                -1;
    nSmoothScale                    4;
    errorReduction                  0.75;
}