coupling/interfoam_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          22500;
        startFace       1321500;
    }
    atmosphere
    {
        type            patch;
        nFaces          22500;
        startFace       1344000;
    }
    interaction
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12000;
        startFace       1366500;
    }
)

// ************************************************************************* //
