coupling/interfoam_case/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;

    }

    bottom
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    obstacle
    {
        type              zeroGradient;
    }

    interaction
    {
        type              zeroGradient;
        //phaseFraction     alpha.water;
        //rho               1000;
        //pRefValue         1e5;
        //pRefPoint         (0 0 0);
        //type            coupledPressure;
        //refValue        uniform 0;
    }
}


// ************************************************************************* //
